# -*- coding: utf-8 -*-
"""
Created on Wed Aug 23 18:45:44 2017

@author: VX
"""

#==============================================================================
# 函數
#==============================================================================

''' 函數
1. 函數可以幫助我們將一有規律的代碼包裝起來直接使用。
2. 函數的好處可以省下底層運算，以便我們直接調用，進而思考更高層次的問題。
'''

#==============================================================================
# 調用函數
#==============================================================================

''' 常用函數
1. abs() 絕對值
*2. enumerate() 
*3. format() 格式化
4. hlep() 幫助
*5. input() 輸入
6. isinstance()
*7. len()
*8. map()
9. max()
10. min()
11. next()
12. pow()
*13. print()
*14. range()
*15. round()
16. sum()
'''
#==============================================================================
# enumerate(iterable, start=0) 回傳以 iterable 與連續整數配對的 enumerate 物件， start 為整數的起始值，預設為 0
#==============================================================================
d = ['Spring', 'Summer', 'Fall', 'Winter']
for i, j in enumerate(d, 1):
    print(i, j)

#==============================================================================
# map(function, iterable, ...) function 為函數， iterable 則為迭代器，此函數取得依 function 計算 iterable 中每個元素的結果
#==============================================================================
def test(x):
    return x > 10
 
a = [11, 2, 8, 22, 6, 4, 15]
for i in map(test, a):
    print(i)

#==============================================================================
# pow(x, y[, z]) 回傳 x^y 之值，或是 x^y % z 之值
#==============================================================================
print(pow(2, 5))
print(pow(2, 6))
print(pow(2, 7))
print(pow(2, 8))
print(pow(2, 9, 3))
print(pow(2, 9, 4))
print(pow(2, 9, 5))
print(pow(2, 9, 6))

#==============================================================================
# range([start], stop[, step])	建立整數序列
#==============================================================================
print(range(10))
print(type(range(10)))
print(list(range(10)))
print(list(range(0, 10)))
print(list(range(0, 10, 2)))
print(list(range(9, -1, -1)))

#==============================================================================
# round(x[, n]) 回傳 x 的最接近數字，預設回傳整數， n 代表小數點位數
#==============================================================================
print(round(12.565687412))
print(round(12.565687412, 1))
print(round(12.565687412, 2))
print(round(12.565687412, 3))
print(round(12.565687412, 4))
print(round(12.565687412, 5))
print(round(12.565687412, 6))
print(round(12.565687412, 7))
#==============================================================================
''' 數據類型轉換
1. bool()
2. bytes() bytesarray()
3. chr()
4. dict()
5. int()
6. float()
7. list()
*8. ord()
9. set()
10. str()
11. tuple()
12. var()
'''
#==============================================================================
# bytes([source[, encoding[, errors]]]) 將 source 轉換為 bytes ，若 source 為字串，需提供 encoding ，也就是字串的編碼格式
# bytearray([source[, encoding[, errors]]])	 將 source 轉換為 bytes ，若 source 為字串，需提供 encoding ，也就是字串的編碼格式
#==============================================================================

d1 = "!@#"
print(type(d1))
d2 = bytes(d1, "utf8")
print(type(d2)) 
print(d2)
for i in d2:
    print(i)
 
d3 = bytes(d1, "ascii")
print(d3)
for i in d3:
    print(i)
    
d1 = b"12345"
print(type(d1))
d2 = bytearray(d1)
print(type(d2)) 
print(d2)
d2[0] = 54   
print(d2)
d2[1] = 55
print(d2) 
d2[2] = 56
print(d2)
d2[3] = 57
print(d2)
d2[4] = 58
print(d2)

#==============================================================================
# ord(c) 回傳字元 c 的 Unicode 編碼值
#==============================================================================
print(ord("a"))
print(ord("e"))
print(ord("t"))
print(ord("A"))
print(ord("B"))
print(ord("L"))
print(ord("5"))
print(ord("8"))

''' 進位轉換
*1. bin()2
*2. hex()16
*3. oct()8
'''
#==============================================================================
# 進制轉換
#==============================================================================
print(bin(32))              
print(bin(128))     
print(bin(512))             
print(bin(2049))
print(hex(32))              
print(hex(128))     
print(hex(512))             
print(hex(2049))
print(oct(32))              
print(oct(128))     
print(oct(512))             
print(oct(2049))
 





















