# -*- coding: utf-8 -*-
"""
Created on Sat Sep  2 14:08:17 2017

@author: VX
"""

#==============================================================================
# 函數式編程
#==============================================================================
'''
函数是Python内建支持的一种封装，我们通过把大段代码拆成函数，通过一层一层的函数调用，
就可以把复杂任务分解成简单的任务，編寫程式的人把程式封裝起來，而使用者只需要調用變行，
如此可以大大的降低使用難度。
'''
#==============================================================================
# 高階函數
#==============================================================================
# 變量可以指向函數本身
print(abs) # <built-in function abs>
print(abs(-10)) # 10

f = abs
print(f) # <built-in function abs>
print(f(-10)) # 10

# 函數名也可以當作變量來指向，但此後無法透過函數名調用此函數
abs = 10
print(abs) # 10


del abs

#==============================================================================
# 傳入函數
#==============================================================================
'''
既然变量可以指向函数，函数的参数能接收变量，
那么函數變也可以作為一個參數傳入另一個函數中，
这种函数就称之为高阶函数。

把函数作为参数传入，这样的函数称为高阶函数，
函数式编程就是指这种高度抽象的编程范式。
'''
# 例

def add_abs(x, y, f):
    return f(x) + f(y)
x = -5
y = 6
f = abs
print(f(x) + f(y)) # 11

print(add_abs(-5, 6, abs)) # 11




