# -*- coding: utf-8 -*-
"""
Created on Tue Aug  1 21:24:16 2017

@author: VX
"""

''' 格式化
%d	整数
%f	浮点数
%s	字符串
%x	十六进制整数
但這不是python 最佳的寫法
'''

#==============================================================================
# format
#==============================================================================

# 格式化至相對應位置
print('{0}, {1}, {0}'.format('abc', '你好'))

# 靠左對齊、靠右對齊、置中
print('{:_>8.4f}, {:_^8.2f}, {:_^8.4f}'.format(6, 302, 78))

# 16進制、8進制、2進制、字符串(可不加)、10進制(可不加)、科學記號(大小寫都可以)
print('{:o}, {:x}, {:b}, {:s}, {:d}, {:.2e}'.format(17, 17, 17, '中文', 17, 17, 17))

# 千分位
print('{:,}'.format(1234567890))

p=['kzc',18]
print('{0[0]},{0[1]}'.format(p))
